#include<stdio.h>
#include<stdlib.h>
#include<assert.h>

#ifndef DEBUG
#define USE_INLINE_MEMORY
#endif

#include "fract.h"

extern "C" {
    __declspec(dllimport) void __stdcall OutputDebugStringA(const char* lpOutputString);
}

#if defined(__GNUC__)
    #define FORCE_INLINE __attribute__((always_inline)) inline
#elif defined(_MSC_VER)
    #define FORCE_INLINE __forceinline
#else
    #define FORCE_INLINE inline
#endif

const unsigned short int cc_FNULL = 0xe364;
const unsigned short int cc_MERCATOR_dash_SCALE = 0xe386;
const unsigned short int cc_CONTOUR_dash_SCALE = 0xe7fd;
const unsigned short int pp_X0_i_ = 0xe370;
const unsigned short int pp_Y0_i_ = 0xe374;
const unsigned short int pp_XYANCHOR = 0xe356; 
const unsigned short int pp_XCON = 0x5916;
const unsigned short int pp_YCON = 0x5921;
const unsigned short int pp_SPHEREWRAP = 0x4cca;
const unsigned short int pp_SIGNEXTEND = 0x4cd8;
const unsigned short int pp_X2 = 0x562e;
const unsigned short int pp_Y2 = 0x5625;
const unsigned short int pp_STD = 0xe35a;
const unsigned short int pp_RATIO = 0xe35e;
const unsigned short int pp_XLL = 0x4e49;
const unsigned short int pp_YLL = 0x4e53;
const unsigned short int pp_XUR = 0x4e5d;
const unsigned short int pp_YUR = 0x4e67;
const unsigned short CONTOUR_RATIO_1 = 20882;
const unsigned short CONTOUR_RATIO_2 = 32767;

#pragma pack(push, 1)
typedef struct
{
    unsigned short int width;
    unsigned short int height;
    unsigned short rowTable;
    unsigned short segment;
} ArrayType;
#pragma pack(pop)

struct FractalState {
    // Original memory locations shown in comments
    
    // Core fractal parameters
    uint16_t x_lower_left;    // regbp+8
    uint16_t y_lower_left;    // regbp+6  
    uint16_t x_upper_right;   // regbp+4
    uint16_t y_upper_right;   // regbp+2
    uint16_t std;             // regbp+0xe (standard deviation/roughness)
    
    // Midpoint coordinates calculated in MIDPT()
    uint16_t x_mid;           // regbp+0xC
    uint16_t y_mid;           // regbp+0xA
    
    // Control flags
    uint16_t dx_greater_than_one;  // 0xe36c DX>1
    uint16_t dy_greater_than_one;  // 0xe368 DY>1
    
    // Ratio values used in NEWSTD()
    uint16_t ratio1;          // 0xe35e RATIO
    uint16_t ratio2;          // 0xe360 RATIO
    
    // Temporary storage
    uint16_t temp_y;          // 0xe396 TY
    
    // Array and wrapping control
    uint16_t xy_anchor;       // 0xe356 XYANCHOR
    uint16_t sphere_wrap;     // 0x4cca SPHEREWRAP
    uint16_t sign_extend;     // 0x4cd8 SIGNEXTEND
    
    // Original coordinate storage
    uint16_t x0;             // 0xe370 X0'
    uint16_t y0;             // 0xe374 Y0'
};

ArrayType CONANCHOR = {0x0009, 0x0007, 0x003f, 0x938c};
ArrayType CONTOUR = {0x003d, 0x0065, 0x1811, 0x91fe};

ArrayType* GlobalArrayDescriptor = nullptr;
static constexpr uint32_t seedOffset = ComputeAddress(StarflightBaseSegment, 0x4ab0);
static uint16_t* RandomSeed = reinterpret_cast<uint16_t*>(&m[seedOffset]);

static const uint16_t MERCATOR_ARRAY = 0x6a99;
static const uint16_t CONANCHOR_ARRAY = 0x6aad;
static const uint16_t CONTOUR_ARRAY = 0x6ac1;

void Store()
{
    unsigned short address = Pop(); // Get the address to store the value at
    unsigned short value = Pop();   // Get the value to store
    Write16(address, value);        // Write the value to the specified address
}

void _2_ex__2() // 2!_2
{
    // Takes 3 params: address, value1, value2
    // Stores value1 at address, value2 at address+2
    unsigned short address = Pop();
    unsigned short val1 = Pop(); 
    unsigned short val2 = Pop();
    
